#include <vector>

// Шейкерная сортировка

/////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////

void ShakerSort(std::vector<int> &arr) {
    int n = arr.size();
    int lb = 0; // Нижняя граница
    int ub = n - 1; // Верхняя граница 
    int k = ub; //  Индекс последнего обмена
    // цикл, который производит сортировку справа налево
    while (lb < ub) { //
        for (int j = ub; j > lb; j--) {
            if (arr[j - 1] > arr[j]) {
                int tmp = arr[j - 1];
                arr[j - 1] = arr[j];
                arr[j] = tmp;
                k = j; // Запоминает индекс последнего обмена
            }
        }
        lb = k; // Сужение области сортировки
        for (int j = lb; j < ub; j++) {
            if (arr[j] > arr[j + 1]) {
                int tmp = arr[j];
                arr[j] = arr[j + 1];
                arr[j + 1] = tmp;
                k = j; // Индекс последнего обмена
            }
        }
        ub = k; // Сужение области сортировки
    }
}


/////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////

// "Быстрая сортировка"

/////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////

int partision(std::vector<int> &arr, int lb, int ub) {
    int p = lb + (ub - lb) / 2; // Опорный элемент - средний. Здесь находится его индекс
    int pivot = arr[p];
    arr[p] = arr[lb]; // Так как опорный элемент запоминается в pivot - то можно элемент нижней границы сразу поставить на место опорного
    int i = lb + 1; // Т.к. считается, что опорный элемент лежит в arr[lb] - нужно начинать с lb + 1
    int j = ub;
    while (i <= j) {
        if (arr[i] < pivot) { // Т.к. "слева" от опорного элемента должны стоять элементы меньше опорного, то их нужно просто пропускать
            i++;
        }
        else if (arr[j] > pivot) { // Аналогично с правой частью
            j--;
        }
        else { // Если же элемент оказался не в той части, то элементы меняются местами, границы сдвигаются
            int tmp = arr[i];
            arr[i] = arr[j];
            arr[j] = tmp;
            i++;
            j--;
        }
    }
    arr[lb] = arr[j];
    arr[j] = pivot;
    return j;
}

void QuickSort(std::vector<int> &arr, int lb, int ub) {
    int p = partision(arr, lb, ub);
    if (p - 1 > lb) {
        QuickSort(arr, lb, p - 1);
    }
    else if (ub - p > 1) {
        QuickSort(arr, p + 1, ub);
    }
}


/////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////